# View Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
View Properties
View Class See Also
---
The View type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AnalysisDisplayStyleId | Element id of Analysis Display Style associated with the view. |
| AreAnalyticalModelCategoriesHidden | Indicates if analytical model categories are currently hidden in the view. |
| AreAnnotationCategoriesHidden | Indicates if annotation categories are currently hidden in the view. |
| AreCoordinationModelHandlesHidden | Indicates if Coordination Model handles are currently hidden in the view. |
| AreImportCategoriesHidden | Indicates if import categories are currently hidden in the view. |
| AreModelCategoriesHidden | Indicates if model categories are currently hidden in the view. |
| ArePointCloudsHidden | Indicates if point clouds are currently hidden in the view. |
| AssemblyInstanceId | The id of the assembly instance to which the element belongs.  (Inherited from Element.) |
| AssociatedAssemblyInstanceId | The Id of the assembly instance that owns the assembly view. |
| BoundingBox | Retrieves a box that circumscribes all geometry of the element. (Inherited from Element.) |
| CanBePrinted | Test whether the view can be printed. |
| Category | Retrieves a Category object that represents the category or sub category in which the element resides. (Inherited from Element.) |
| CreatedPhaseId | Id of a Phase at which the Element was created.  (Inherited from Element.) |
| CropBox | The Crop Box applied to the view, or an outline encompassing the crop region applied to the view. |
| CropBoxActive | Whether or not the Crop Box/Region is active for the view. |
| CropBoxVisible | Whether or not the Crop Box/Region is visible for the view. |
| DemolishedPhaseId | Id of a Phase at which the Element was demolished.  (Inherited from Element.) |
| DesignOption | Returns the design option to which the element belongs. (Inherited from Element.) |
| DetailLevel | The detail level of this view. |
| Discipline | The Discipline of the view. |
| DisplayStyle | The DisplayStyle of the view. Returns DisplayStyle.Wireframe if the view has no display style. |
| Document | Returns the Document in which the Element resides. (Inherited from Element.) |
| GenLevel | The level for the view. |
| Geometry | Retrieves the geometric representation of the element. (Inherited from Element.) |
| GroupId | The id of the group to which an element belongs.  (Inherited from Element.) |
| Id | A unique identifier for an Element in an Autodesk Revit project.  (Inherited from Element.) |
| IsAssemblyView | Indicates if the view is assembly view. |
| IsCallout | Indicates if the view is a callout view. |
| IsModifiable | Identifies if the element is modifiable.  (Inherited from Element.) |
| IsTemplate | Test whether the view is a view template. |
| IsTransient | Indicates whether an element is transient or permanent.  (Inherited from Element.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from Element.) |
| LevelId | The id of the level associated with the element.  (Inherited from Element.) |
| Location | This property is used to find the physical location of an element within a project. (Inherited from Element.) |
| Name | A human readable name for the Element. (Inherited from Element.) |
| Origin | Returns the origin of the screen. |
| Outline | The bounds of the view in paper space (in feet). |
| OwnerViewId | The id of the view that owns the element.  (Inherited from Element.) |
| [Parameter[([( Guid])]) ](2e852bc4-46c6-5598-cc45-0eaf38cf8973.md "Parameter Property \(Guid\)") | Retrieves a parameter from the element given a GUID for a shared parameter. (Inherited from Element.) |
| [Parameter[([( BuiltInParameter])]) ](2f91a9f3-7f69-72f9-08d6-a2d71dfb33db.md "Parameter Property \(BuiltInParameter\)") | Retrieves a parameter from the element given a parameter id. (Inherited from Element.) |
| [Parameter[([( Definition])]) ](87d8a88c-906e-85a9-f575-f263788b8584.md "Parameter Property \(Definition\)") | Retrieves a parameter from the element based on its definition. (Inherited from Element.) |
| Parameters | Retrieves a set containing all of the parameters that are contained within the element. (Inherited from Element.) |
| ParametersMap | Retrieves a map containing all of the parameters that are contained within the element. (Inherited from Element.) |
| PartsVisibility | The visibility setting for parts in this view. |
| Pinned | Identifies if the element has been pinned to prevent changes.  (Inherited from Element.) |
| RevealConstraintsMode | Indicates whether the Reveal Constraints mode is activated in the view. |
| RightDirection | The direction towards the right side of the screen. |
| Scale | The scale of the view. |
| ShadowIntensity | The intesity of cast shadows - 0 = no shadows, 100 = black. |
| SketchPlane | The sketch plane assigned to the view for model curve creation. |
| SunAndShadowSettings | The sun and shadow settings assigned to the view for shadow calculation and rendering. |
| SunlightIntensity | The intensity of the simulated (directional) sunlight. 0 = no directional light; maximum value is 100. |
| TemporaryViewModes | Data of temporary view modes associated with this view. |
| Title | The view title. This consists of the view name plus other modifiers, such as the view type, sheet number, area scheme, and/or assembly type, depending on the specifics of the view. |
| UniqueId | A stable unique identifier for an element within the document.  (Inherited from Element.) |
| UpDirection | The direction towards the top of the screen. |
| VersionGuid | Get the element version Guid.  (Inherited from Element.) |
| ViewDirection | The direction towards the viewer. |
| ViewSpecific | Identifies if the element is owned by a view.  (Inherited from Element.) |
| ViewTemplateId | The id of the template view that controls this view's parameters. |
| ViewType | The type of the view. |
| WorksetId | Get Id of the Workset which owns the element.  (Inherited from Element.) |

# See Also
View Class
Autodesk.Revit.DB Namespace